import decor1 from "../assets/decor1.png";
import decor2 from "../assets/decor2.png";
import decor3 from "../assets/decor3.png";
import decor4 from "../assets/decor4.png";
import decor5 from "../assets/decor5.png";
import decor6 from "../assets/decor6.png";

import stop1 from "../assets/stop1.png";
import stop2 from "../assets/stop2.png";
import stop3 from "../assets/stop3.png";
import stop4 from "../assets/stop4.png";
import stop5 from "../assets/stop5.png";
import stop6 from "../assets/stop6.png";

export const pointProps = [
  {
    pointX: 231,
    pointY: 238,
    decorX: 182,
    decorY: 256,
    decorW: 167,
    decorH: 79,
    decor: decor1,
    stop: stop1,
    title: "Ура, Ваша Оcтановка: “ДАЧНЫЕ ЗАБАВЫ”!",
    text: "Сборная семьи выходит на дорожку между грядками и принимает низкий старт. Бабушка управляет расстановкой игроков на поле. Это не игра, это сражение с природой. Комья земли летят из-под ног, слышен шум деревьев и подбадривающие крики дачных птиц. Мы выиграем, зажжем в честь победы огонь мангала и отпразднуем это напитком «Моя семья»!",
  },
  {
    pointX: 420,
    pointY: 160,
    decorX: 303,
    decorY: 62,
    decorW: 113,
    decorH: 94,
    decor: decor2,
    stop: stop2,
    title: "Ура, Ваша ОСтановка: “ОДИН ЗА ВСЕХ”!",
    text: "У каждого в семье свои спортивные достижения. Папа — чемпион-добытчик. Мама — мастер спорта по домашнему уюту. Бабушка — главный тренер по правильному питанию. Дочь идет на золотую медаль в учебе. А сын — первая ракетка  по семейным играм и развлечениям. С «Моей семьей» мы чувствуем, что вместе мы - команда, где один за всех и все за одного!",
  },
  {
    pointX: 409,
    pointY: 282,
    decorX: 429,
    decorY: 233,
    decorW: 148,
    decorH: 96,
    decor: decor3,
    stop: stop3,
    title: "Ура, Ваша ОСтановка: “ВОДНЫЕ ПРОЦЕДУРЫ”!",
    text: "Семья ныряет с головой в пучину отдыха! Мы заплываем за буйки обыденности. Дети резвятся, родители отмокают. Никому не хочется выходить из этого водоворота веселья. Усталыми, но довольными китами мы выбрасываемся из воды, чтобы глотнуть микс «Моя семья».",
  },
  {
    pointX: 605,
    pointY: 356,
    decorX: 531,
    decorY: 390,
    decorW: 95,
    decorH: 83,
    decor: decor4,
    stop: stop4,
    title: "Ура, Ваша ОСтановка: “Шоппинг-забег”!",
    text: "Вся семья болеет за маму, которая встала на скользкую дорожку забега по магазинам. Какие трофеи принесет она в этот раз? Успеет ли финишировать раньше, чем закончатся цифры на банковском счете? Встретят ее домашние криками поддержки или угрюмым молчанием? В любом случае, на финише ждет «Моя семья»!",
  },
  {
    pointX: 325,
    pointY: 376,
    decorX: 241,
    decorY: 374,
    decorW: 128,
    decorH: 87,
    decor: decor5,
    stop: stop5,
    title: "Ура, Ваша Остановка: “ФИТНЕС-ПАУЗА”!",
    text: "Итак, время зарядки. Сделайте глубокий вдох. Примите удобную позу. Замрите в этом состоянии. Почувствуйте, как тело наливается бодростью, а голова – свежестью. Налейте микс «Моя семья». Ваш стакан наполовину полон, и все идет по планке! Вы снова полны сил для ежедневных свершений.",
  },
  {
    pointX: 671,
    pointY: 191,
    decorX: 612,
    decorY: 223,
    decorW: 103,
    decorH: 81,
    decor: decor6,
    stop: stop6,
    title: "Ура, Ваша Остановка: “ВСЕЙ СЕМЬЕЙ НА ПИКНИК”!",
    text: "Семья встает на колеса и “делает ноги” из города. Мы обожаем пикник! Здесь нет правил! Никто не запрещает есть руками, сидеть на земле, разговаривать во время еды. Папа жарит шашлык, мама загорает на солнышке. И наполняя стаканы напитками «Моя семья», мы щущаем, как наполняемся счастьем!",
  },
];
